Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/separation_and_divorce/legal_options_following_civil_partnership_breakdown.html.txt.tmx
Source language: en
Languages: ga

source: Legal options following the breakdown of a civil partnership
ga: Roghanna dlíthiúla tar éis cliseadh pháirtnéireacht shibhialta

source: When a civil partnership first breaks up, the civil partners can informally separate and live apart
ga: Nuair a chliseann páirtnéireacht shibhialta, is féidir leis na páirtnéirí sibhialta scaradh go neamhfhoirmiúil agus maireachtáil scartha óna chéile

source: A civil partnership breakdown can affect all areas of a person' s life and most people will go on to regulate matters between them in a legal context
ga: Is féidir le cliseadh pháirtnéireacht shibhialta dul i bhfeidhm ar gach réimse de shaol duine agus téann an chuid is mó de dhaoine ar aghaidh chun cúrsaí a rialú eatarthu i gcomhthéacs dlíthiúil

source: There are two different ways of doing this:
ga: Tá dhá bhealach difriúil ann chun é seo a dhéanamh:

source: A separation agreement is reached through agreement between the parties and agreement can be achieved in a number of ways
ga: Tagtar ar chomhaontú scartha trí aontú idir na páirtithe agus is féidir comhaontú a bhaint amach ar roinnt bealaí

source: However, only a decree of dissolution dissolves the civil partnership and allows each party to marry
ga: Ní thugann ach foraithne díscaoileadh amháin díscaoileadh ar an bpáirtnéireacht shibhialta, áfach, agus ceadaíonn sé do gach páirtí pósadh

source: In specific circumstances, a court can grant a nullity decree
ga: I gcúinsí sonracha, is féidir le cúirt foraithne neamhnithe a bhronnadh

source: The effect of a nullity decree is that the court determines that no civil partnership ever existed
ga: Is é éifeacht an fhoraithne neamhnithe ná go gcinneann an chúirt nach raibh páirtnéireacht shibhialta ann riamh

source: The law in relation to nullity is complex, and you should always seek legal advice to assess whether the circumstances exist for a nullity application
ga: Tá an dlí i ndáil le neamhniú casta, agus ba cheart duit comhairle dhíthiúil a fháil i gcónaí chun a mheas an bhfuil na cúinsí ann d’iarratas neamhnithe nó nach bhfuil
